workloads/llama.cpp/scripts/xcoord/results/poc1_serving_r1/poc1_20260228_015725/bench_uvm_xcoord.txt
INFO 02-28 02:03:41 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x721dea5e1360>, seed=0, num_prompts=20, dataset_name='sharegpt', no_stream=False, dataset_path='/home/yunwei37/workspace/gpu/gpu_ext/workloads/llama.cpp/datasets/sharegpt_vicuna.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://127.0.0.1:8013', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='ggml-org_gpt-oss-20b-GGUF_gpt-oss-20b-mxfp4', tokenizer='Qwen/Qwen3-30B-A3B-FP8', use_beam_search=False, logprobs=None, request_rate=0.2, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed. Starting main benchmark run...
Traffic request rate: 0.2
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     20        
Maximum request concurrency:             1         
Request rate configured (RPS):           0.20      
Benchmark duration (s):                  103.44    
Total input tokens:                      4270      
Total generated tokens:                  5088      
Request throughput (req/s):              0.19      
Output token throughput (tok/s):         49.19     
Peak output token throughput (tok/s):    264.00    
Peak concurrent requests:                3.00      
Total Token throughput (tok/s):          90.47     
---------------Time to First Token----------------
Mean TTFT (ms):                          67.97     
Median TTFT (ms):                        65.03     
P99 TTFT (ms):                           153.07    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.95      
Median TPOT (ms):                        4.68      
P99 TPOT (ms):                           6.19      
---------------Inter-token Latency----------------
Mean ITL (ms):                           4.84      
Median ITL (ms):                         3.89      
P99 ITL (ms):                            8.78      
==================================================
warning: `VIRTUAL_ENV=/home/yunwei37/workspace/gpu/gpu_ext/workloads/llama.cpp/.venv` does not match the project environment path `.venv` and will be ignored; use `--active` to target the active environment instead

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 00:00 elapsed, 6:51:31 remaining

  0%|          | 0/20 [00:00<?, ?it/s]
  5%|▌         | 1/20 [00:04<01:18,  4.15s/it]
 10%|█         | 2/20 [00:12<01:57,  6.52s/it]
 15%|█▌        | 3/20 [00:14<01:14,  4.38s/it]
 20%|██        | 4/20 [00:17<01:02,  3.91s/it]
 25%|██▌       | 5/20 [00:19<00:47,  3.18s/it]
 30%|███       | 6/20 [00:26<01:04,  4.61s/it]
 35%|███▌      | 7/20 [00:26<00:40,  3.14s/it]
 40%|████      | 8/20 [00:35<00:58,  4.86s/it]
 45%|████▌     | 9/20 [00:49<01:26,  7.86s/it]
 50%|█████     | 10/20 [00:53<01:05,  6.52s/it]
 55%|█████▌    | 11/20 [00:58<00:56,  6.22s/it]
 60%|██████    | 12/20 [01:03<00:45,  5.72s/it]
 65%|██████▌   | 13/20 [01:05<00:32,  4.58s/it]
 70%|███████   | 14/20 [01:17<00:41,  6.99s/it]
 75%|███████▌  | 15/20 [01:18<00:24,  4.94s/it]
 80%|████████  | 16/20 [01:18<00:14,  3.68s/it]
 85%|████████▌ | 17/20 [01:20<00:08,  2.97s/it]
 90%|█████████ | 18/20 [01:26<00:07,  3.91s/it]
 95%|█████████▌| 19/20 [01:31<00:04,  4.33s/it]
100%|██████████| 20/20 [01:43<00:00,  6.60s/it]
100%|██████████| 20/20 [01:43<00:00,  5.17s/it]